# CreateDefaultPathReinforcementType Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
PathReinforcementType..::..CreateDefaultPathReinforcementType Method
PathReinforcementType Class See Also
---
Creates a new PathReinforcementType object with a default name.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public static ElementId CreateDefaultPathReinforcementType(
	Document ADoc
)
```

Visual Basic
---
```text
Public Shared Function CreateDefaultPathReinforcementType ( _
	ADoc As Document _
) As ElementId
```

Visual C++
---
```text
public:
static ElementId^ CreateDefaultPathReinforcementType(
	Document^ ADoc
)
```

# ### Parameters
ADoc
    Type: Autodesk.Revit.DB..::..Document The document.
# ### Return Value
The newly created type id.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
PathReinforcementType Class
Autodesk.Revit.DB.Structure Namespace